var data = {

    trend: {
        "code": "A00000",
        "names": ["上新了·故宫"],
        "ids": [230495601],
        "details": [
            {
                "data": [4203, 4461, 4854, 4846, 4424, 4126, 3928],
                "name": "上新了·故宫"
            }
        ],
        "playtime": ["20181123", "20181124", "20181125", "20181126",
            "20181127", "20181128", "20181129"]
    },

    platform: {
        "code": "A00000",
        "names": ["上新了·故宫"],
        "data": [
            {
                "name": "移动端",
                "value": 0.79
            },
            {
                "name": "PC端",
                "value": 0.21
            }
        ],
        "ids": [230495601]
    },
    province: {
        "code": "A00000",
        "names": ["上新了·故宫"],
        "data": [
            [
                {
                    "name": "北京市",
                    "value": 1499240
                },
                {
                    "name": "浙江省",
                    "value": 995505
                },
                {
                    "name": "上海市",
                    "value": 985460
                },
                {
                    "name": "江苏省",
                    "value": 783907
                },
                {
                    "name": "天津市",
                    "value": 766293
                },
                {
                    "name": "福建省",
                    "value": 740049
                },
                {
                    "name": "广东省",
                    "value": 717708
                },
                {
                    "name": "海南省",
                    "value": 572133
                },
                {
                    "name": "河北省",
                    "value": 568316
                },
                {
                    "name": "重庆市",
                    "value": 517247
                },
                {
                    "name": "河南省",
                    "value": 508354
                },
                {
                    "name": "安徽省",
                    "value": 493523
                },
                {
                    "name": "山东省",
                    "value": 492217
                },
                {
                    "name": "辽宁省",
                    "value": 489282
                },
                {
                    "name": "江西省",
                    "value": 485820
                },
                {
                    "name": "山西省",
                    "value": 481930
                },
                {
                    "name": "陕西省",
                    "value": 474563
                },
                {
                    "name": "湖北省",
                    "value": 438486
                },
                {
                    "name": "广西壮族自治区",
                    "value": 424070
                },
                {
                    "name": "四川省",
                    "value": 409325
                },
                {
                    "name": "内蒙古自治区",
                    "value": 407703
                },
                {
                    "name": "湖南省",
                    "value": 406592
                },
                {
                    "name": "吉林省",
                    "value": 398374
                },
                {
                    "name": "贵州省",
                    "value": 363682
                },
                {
                    "name": "黑龙江省",
                    "value": 357221
                },
                {
                    "name": "宁夏回族自治区",
                    "value": 351454
                },
                {
                    "name": "云南省",
                    "value": 338978
                },
                {
                    "name": "西藏自治区",
                    "value": 304931
                },
                {
                    "name": "青海省",
                    "value": 295988
                },
                {
                    "name": "甘肃省",
                    "value": 257539
                },
                {
                    "name": "新疆维吾尔自治区",
                    "value": 231137
                },
                {
                    "name": "澳门特别行政区",
                    "value": 167608
                },
                {
                    "name": "香港特别行政区",
                    "value": 44085
                },
                {
                    "name": "台湾",
                    "value": 38010
                }
            ]
        ],
        "ids": [230495601]
    },
}