/**
 * http://index.iqiyi.com/q/?name=%E4%B8%8A%E6%96%B0%E4%BA%86%C2%B7%E6%95%85%E5%AE%AB&aid=230495601
 * */
var data={
    "code": "A00000",
    "names": ["上新了·故宫"],
    "data":
        {
            "genderLabels": ["帅哥", "美女"],
            "constellationLabels": ["白羊座", "金牛座", "双子座", "巨蟹座", "狮子座", "处女座", "天秤座", "天蝎座", "射手座", "摩羯座", "水瓶座", "双鱼座"],
            "interestLabels": ["追星族", "数码达人", "网购达人", "美食达人", "商务人士", "时尚达人", "旅行达人", "游戏达人", "理财达人", "家庭主妇", "运动达人", "摄影达人", "玩车一族"],
            "educationLabels": ["小学", "初中", "高中-中专", "大专", "本科", "硕士以上"],
            "ageLabels": ["1-17", "18-24", "25-30", "31-35", "36-40", "40+"],
            "details": [{
                "230495601": {
                    "gender": [0.3648, 0.6352],
                    "age": [0.0776, 0.1876, 0.3018, 0.2943, 0.1071, 0.0315],
                    "constellation": [0.0747, 0.0834, 0.0874, 0.0869, 0.0858, 0.085, 0.0843, 0.0923, 0.0803, 0.0816, 0.0789, 0.0794],
                    "education": [0.0764, 0.09, 0.1566, 0.2399, 0.3181, 0.119],
                    "interest": [88, 103, 101, 100, 99, 99, 90, 104, 96, 113, 94, 96, 109]
                }
            }]
        }
    ,
    "ids": [230495601]
}