var data = {

    trend: {
        "code": "A00000",
        "names": ["上新了·故宫"],
        "ids": [230495601],
        "details": [
            {
                "data": [4203, 4461, 4854, 4846, 4424, 4126, 3928],
                "name": "上新了·故宫"
            }
        ],
        "playtime": ["20181123", "20181124", "20181125", "20181126",
            "20181127", "20181128", "20181129"]
    },

    platform: {
        "code": "A00000",
        "names": ["上新了·故宫"],
        "data": [
            {
                "name": "移动端",
                "value": 0.79
            },
            {
                "name": "PC端",
                "value": 0.21
            }
        ],
        "ids": [230495601]
    }
}